MOVES = [
    ("СС", "СС"),
    ("СС", "ТР"),
    ("СС", "ДЗ"),
    ("ТР", "СС"),
    ("ТР", "ТР"),
    ("ТР", "ДЗ"),
    ("ДЗ", "СС"),
    ("ДЗ", "ТР"),
    ("ДЗ", "ДЗ"),
]

DEFENSE_MOVES = {
    "Аге уке": {
        "control": "СС",
        "attack_defense": ["ДЗ", "ТР"],
        "counter_attack": ["ДЗ"],
    },
    "Учи уке": {
        "control": "СС",
        "attack_defense": ["ДЗ", "ТР", "СС"],
        "counter_attack": ["ДЗ", "ТР", "СС"],
    },
    "Сото уке": {
        "control": "ТР",
        "attack_defense": ["ДЗ", "ТР", "СС"],
        "counter_attack": ["ДЗ", "ТР", "СС"],
    },
    "Гедан барай": {
        "control": "ДЗ",
        "attack_defense": ["ТР", "СС", "ГДН"],
        "counter_attack": ["ТР", "СС", "ГДН"],
    },
}
